
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |           3 |          0 |
## Affected resources by action

|  Action  | Resources                                                              |
|:--------:|:-----------------------------------------------------------------------|
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`           |
|    🟡    | `module.actions-runner.aws_iam_policy.required`                        |
|    🟡    | `module.actions-runner.module.instance-profile.aws_iam_policy.profile` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:SetInstanceHealth",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*",
            ]
        }
    }

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-2024122120350701390000000c-9wY7dU"
        name                             = "actions-runner-2024122120350701390000000c-9wY7dU"
      ~ vpc_zone_identifier              = [
          - "subnet-0a205209260302668",
          - "subnet-0a3a8e5a973c88986",
          + "subnet-004bd6d011ea52557",
          + "subnet-0dbff142ba4620c5f",
        ]
        # (30 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # module.actions-runner.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::303467602807:policy/terraform-20241221203559213900000015"
        name             = "terraform-20241221203559213900000015"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:SetInstanceHealth",
                          - "autoscaling:DescribeAutoScalingInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.instance-profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::303467602807:policy/actions-runner-sbn5RaTtAltb20241221203559214000000016"
        name             = "actions-runner-sbn5RaTtAltb20241221203559214000000016"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:SetInstanceHealth",
                          - "autoscaling:DescribeAutoScalingInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAzLCAiZGVzdHJveSI6IDB9fQ==
```
</details>